using UnityEditor;
using UnityEngine;
using UnityEngine.Events;
using UnityEngine.InputSystem;

[RequireComponent(typeof(PlayerInput))]
[DisallowMultipleComponent]
[AddComponentMenu("  Runity/Управление")]
public class Управление : RunityComponent
{
    void Awake() => оригинальныйКомпонент = GetComponent<PlayerInput>();
    void OnValidate() => Awake();
    public PlayerInput оригинал => (PlayerInput)оригинальныйКомпонент;


    public InputActionAsset наборНастроек
    {
        get => оригинал.actions;
        set => оригинал.actions = value;
    }

    public void УстановитьСтандартныеНастройки()
    {
        наборНастроек = НайтиАссет<InputActionAsset>("198cc02dd732403458fa293529a9203c");
        оригинал.defaultActionMap = "Стандартная";
    }


    static Флажок _вперёд; void OnВперёд(InputValue данные) => _вперёд = данные.isPressed;
    static Флажок _вперёдНажато; public static Флажок вперёдНажато => _вперёдНажато;
    static Флажок _вперёдУдерживается; public static Флажок вперёдУдерживается => _вперёдУдерживается;
    static Флажок _вперёдОтжато; public static Флажок вперёдОтжато => _вперёдОтжато;

    static Флажок _влево; void OnВлево(InputValue данные) => _влево = данные.isPressed;
    static Флажок _влевоНажато; public static Флажок влевоНажато => _влевоНажато;
    static Флажок _влевоУдерживается; public static Флажок влевоУдерживается => _влевоУдерживается;
    static Флажок _влевоОтжато; public static Флажок влевоОтжато => _влевоОтжато;

    static Флажок _назад; void OnНазад(InputValue данные) => _назад = данные.isPressed;
    static Флажок _назадНажато; public static Флажок назадНажато => _назадНажато;
    static Флажок _назадУдерживается; public static Флажок назадУдерживается => _назадУдерживается;
    static Флажок _назадОтжато; public static Флажок назадОтжато => _назадОтжато;

    static Флажок _вправо; void OnВправо(InputValue данные) => _вправо = данные.isPressed;
    static Флажок _вправоНажато; public static Флажок вправоНажато => _вправоНажато;
    static Флажок _вправоУдерживается; public static Флажок вправоУдерживается => _вправоУдерживается;
    static Флажок _вправоОтжато; public static Флажок вправоОтжато => _вправоОтжато;

    static Флажок _пробел; void OnПробел(InputValue данные) => _пробел = данные.isPressed;
    static Флажок _пробелНажат; public static Флажок пробелНажат => _пробелНажат;
    static Флажок _пробелУдерживается; public static Флажок пробелУдерживается => _пробелУдерживается;
    static Флажок _пробелОтжат; public static Флажок пробелОтжат => _пробелОтжат;

    static Флажок _выход; void OnВыход(InputValue данные) => _выход = данные.isPressed;
    static Флажок _выходНажат; public static Флажок выходНажат => _выходНажат;
    static Флажок _выходУдерживается; public static Флажок выходУдерживается => _выходУдерживается;
    static Флажок _выходОтжат; public static Флажок выходОтжат => _выходОтжат;

    static Флажок _ЛКМ; void OnЛКМ(InputValue данные) => _ЛКМ = данные.isPressed;
    static Флажок _ЛКМНажата; public static Флажок ЛКМНажата => _ЛКМНажата;
    static Флажок _ЛКМУдерживается; public static Флажок ЛКМУдерживается => _ЛКМУдерживается;
    static Флажок _ЛКМОтжата; public static Флажок ЛКМОтжата => _ЛКМОтжата;

    static Флажок _ПКМ; void OnПКМ(InputValue данные) => _ПКМ = данные.isPressed;
    static Флажок _ПКМНажата; public static Флажок ПКМНажата => _ПКМНажата;
    static Флажок _ПКМУдерживается; public static Флажок ПКМУдерживается => _ПКМУдерживается;
    static Флажок _ПКМОтжата; public static Флажок ПКМОтжата => _ПКМОтжата;

    static Флажок _использовать; void OnИспользовать(InputValue данные) => _использовать = данные.isPressed;
    static Флажок _использоватьНажато; public static Флажок использоватьНажато => _использоватьНажато;
    static Флажок _использоватьУдерживается; public static Флажок использоватьУдерживается => _использоватьУдерживается;
    static Флажок _использоватьОтжато; public static Флажок использоватьОтжато => _использоватьОтжато;

    static Флажок _ускорение; void OnУскорение(InputValue данные) => _ускорение = данные.isPressed;
    static Флажок _ускорениеНажато; public static Флажок ускорениеНажато => _ускорениеНажато;
    static Флажок _ускорениеУдерживается; public static Флажок ускорениеУдерживается => _ускорениеУдерживается;
    static Флажок _ускорениеОтжато; public static Флажок ускорениеОтжато => _ускорениеОтжато;


    static Флажок _движениеНажато; public static Флажок движениеНажато => _движениеНажато;
    static Флажок _движениеУдерживается; public static Флажок движениеУдерживается => _движениеУдерживается;
    static Флажок _движениеОтжато; public static Флажок движениеОтжато => _движениеОтжато;


    void Update()
    {
        void ОбновитьПеременные(ref Флажок основа, ref Флажок удерживается, ref Флажок нажато, ref Флажок отжато)
        {
            if (удерживается != основа)
            {
                удерживается = основа;
                нажато = основа;
                отжато = !основа;
            }
            else
            {
                нажато = false;
                отжато = false;
            }
        }

        ОбновитьПеременные(ref _вперёд, ref _вперёдУдерживается, ref _вперёдНажато, ref _вперёдОтжато);
        ОбновитьПеременные(ref _влево, ref _влевоУдерживается, ref _влевоНажато, ref _влевоОтжато);
        ОбновитьПеременные(ref _назад, ref _назадУдерживается, ref _назадНажато, ref _назадОтжато);
        ОбновитьПеременные(ref _вправо, ref _вправоУдерживается, ref _вправоНажато, ref _вправоОтжато);

        _движениеНажато = _вперёдНажато || _влевоНажато || _назадНажато || _вправоНажато;
        _движениеУдерживается = _вперёдУдерживается || _влевоУдерживается || _назадУдерживается || _вправоУдерживается;
        _движениеОтжато = _вперёдОтжато || _влевоОтжато || _назадОтжато || _вправоОтжато;

        ОбновитьПеременные(ref _пробел, ref _пробелУдерживается, ref _пробелНажат, ref _пробелОтжат);
        ОбновитьПеременные(ref _выход, ref _выходУдерживается, ref _выходНажат, ref _выходОтжат);
        ОбновитьПеременные(ref _ЛКМ, ref _ЛКМУдерживается, ref _ЛКМНажата, ref _ЛКМОтжата);
        ОбновитьПеременные(ref _ПКМ, ref _ПКМУдерживается, ref _ПКМНажата, ref _ПКМОтжата);
        ОбновитьПеременные(ref _использовать, ref _использоватьУдерживается, ref _использоватьНажато, ref _использоватьОтжато);
        ОбновитьПеременные(ref _ускорение, ref _ускорениеУдерживается, ref _ускорениеНажато, ref _ускорениеОтжато);

    }

    /*[SerializeField] UnityEvent _приДвижении;
    public UnityEvent приДвижении => _приДвижении;*/
}

#if UNITY_EDITOR
[CanEditMultipleObjects]
[CustomEditor(typeof(Управление))]
internal class УправлениеEditor : RunityEditor<Управление>
{
    public override void OnInspectorGUI()
    {
        Текст("Этот объект реагирует на нажатия кнопок и движения мышкой");

        Пробел();

        Синхрополе("Набор настроек", x => x.наборНастроек,
            (title, value) => Объект<InputActionAsset>(title, value));

        Кнопка("Стандартные настройки", () =>
        {
            компонент.УстановитьСтандартныеНастройки();
        });

        /*Пробел();

        НачатьСобытия();
        //Событие("При движении", "_приДвижении");
        ЗакончитьСобытия();*/
    }
}
#endif