using UnityEngine;

public static class Математика
{
    public static Дробное Ограничить(Дробное значение, Дробное минимум, Дробное максимум) => Mathf.Clamp(значение, минимум, максимум);
    public static Число Ограничить(Число значение, Число минимум, Число максимум) => Mathf.Clamp(значение, минимум, максимум);
    public static Дробное ОграничитьСнизу(Дробное значение, Дробное минимум) => Mathf.Clamp(значение, минимум, значение + 1);
    public static Число ОграничитьСнизу(Число значение, Число минимум) => Mathf.Clamp(значение, минимум, значение + 1);
    public static Дробное ОграничитьСверху(Дробное значение, Дробное максимум) => Mathf.Clamp(значение, значение - 1, максимум);
    public static Число ОграничитьСверху(Число значение, Число максимум) => Mathf.Clamp(значение, значение - 1, максимум);
    public static Число Округлить(Дробное значение) => Mathf.RoundToInt(значение);
    public static Число ОкруглитьВниз(Дробное значение) => Mathf.FloorToInt(значение);
    public static Число ОкруглитьВверх(Дробное значение) => Mathf.CeilToInt(значение);
}
