using UnityEngine;

internal class Player : Компонент
{
    //public float скорость;
    public Объект префабПули;
    public Список<Объект> объекты;
    public Список<Число> числа;

    public int age = 5;
    public Флажок возраст1;

    float speed = 5.4f;
    Дробное скорость = 5.4;

    Направление2D направление = Направление2D.вправо;
    Vector2 dir = Vector2.up;

    void Start()
    {
        направление = направление * 5;
        if (скорость == speed)
        dir *= Vector2.down;
        Консоль.Напечатать(возраст1);
    }

    /*void OnMove(InputValue value)
    {
        //физическоеТело2D.движение = value.ИзвлечьV2() * скорость;
    }

    void OnShoot()
    {
        Объект новаяПуля = Заспавнить(префабПули);
        новаяПуля.НайтиКомпонент<ФизическоеТело2D>().движение = new Направление2D(1, 0);

        новаяПуля.трансформация.размер *= 0.5f;
        новаяПуля.трансформация.размерX += 5;
        новаяПуля.трансформация.позицияX = 5;
    }

    void OnShootHold()
    {
        //отрисовщикСпрайта.УстановитьЦвет(Цвет.пшеничный);
    }

    void OnMegaShoot()
    {
        Заспавнить(префабПули, transform.position, mouseWorldPosition, да);//.НайтиКомпонент<ФизическоеТело2D>().движение = new Направление2D(1, 0);
        НайтиКомпонент<Спрайтер>().цвет = Цвет.белый;
    }

    void Update()
    {
        //GetComponent<TextMeshProUGUI>().text = возраст;
        if (Управление.вперёдУдерживается)
        {
            Консоль.Напечатать("Бегу, дорогуша");
        }
        else if (Управление.назадУдерживается)
        {
            Консоль.Напечатать("Да ну нафиг");
        }
    }*/
}